# Merging Data

In this workbook, you will learn how to merge two data frames together in Pandas. Merging is equivalent to SQL joins, for those of you familiar with that.

Suppose we want to know which names increased and decreased the most in popularity between 1990 and 2000. While we can concatenate the two DataFrames (stack them on top of each other), it is easier to merge the two DataFrames (stack them next to each other) so that the numbers for 1990 and 2000 are side by side.

In [1]:
import pandas as pd
pd.set_option("display.max_rows", 15)

In [4]:
data90 = pd.read_csv("/data/names/yob1990.txt", names=["Name", "Gender", "Count"])
data00 = pd.read_csv("/data/names/yob2000.txt", names=["Name", "Gender", "Count"])
data00

           Name Gender  Count
0         Emily      F  25953
1        Hannah      F  23075
2       Madison      F  19967
3        Ashley      F  17997
4         Sarah      F  17689
5        Alexis      F  17627
6      Samantha      F  17264
...         ...    ...    ...
29757     Zelig      M      5
29758     Zemar      M      5
29759      Zeph      M      5
29760     Zeven      M      5
29761     Ziggy      M      5
29762        Zo      M      5
29763     Zyier      M      5

[29764 rows x 3 columns]

We can use the `.merge()` method of a data frame to "stack" another data frame next to it. Note that this method _returns_ a new data frame, rather than modifying the existing one in place.

We have to specify:

- the "other" data frame
- what variables to join on (by default, it joins on all columns that exist in both data frames)
- how to do the join (by default, it does an inner join)

In [5]:
data_merged = data90.merge(data00, on=["Name", "Gender"])
data_merged

            Name Gender  Count_x  Count_y
0        Jessica      F    46470    15705
1         Ashley      F    45553    17997
2       Brittany      F    36534     5183
3         Amanda      F    34405     8550
4       Samantha      F    25865    17264
5          Sarah      F    25810    17689
6      Stephanie      F    24859     7029
...          ...    ...      ...      ...
17537     Zander      M        5      150
17538   Zedekiah      M        5       10
17539     Zephan      M        5        8
17540       Zeus      M        5       31
17541      Ziyad      M        5       17
17542      Zoran      M        5        9
17543        Zvi      M        5       10

[17544 rows x 4 columns]

Notice that Pandas found a `Count` column in both data frames, but `Count` was not one of the columns that we joined on. So Pandas had to distinguish between the `Count`s from the left and right data frames. To do this, it appended `_x` to the `Count` from the left data frame and `_y` to the one from the right.

We can customize this by specifying the `suffixes=` argument.

In [7]:
data_merged = data90.merge(data00, on=["Name", "Gender"], suffixes=("90","00"))
data_merged

            Name Gender  Count90  Count00
0        Jessica      F    46470    15705
1         Ashley      F    45553    17997
2       Brittany      F    36534     5183
3         Amanda      F    34405     8550
4       Samantha      F    25865    17264
5          Sarah      F    25810    17689
6      Stephanie      F    24859     7029
...          ...    ...      ...      ...
17537     Zander      M        5      150
17538   Zedekiah      M        5       10
17539     Zephan      M        5        8
17540       Zeus      M        5       31
17541      Ziyad      M        5       17
17542      Zoran      M        5        9
17543        Zvi      M        5       10

[17544 rows x 4 columns]

Let's check to see if there are any missing entries in either `Count` column.

In [11]:
data_merged["Count90"].isnull().sum(), data_merged["Count00"].isnull().sum()

(0, 0)

Now with the data side by side, it's trivial to figure out which names increased and decreased the most in popularity.

In [15]:
data_merged["CountDiff"] = (data_merged["Count00"] - data_merged["Count90"])
data_merged.sort_values("CountDiff")

              Name Gender  Count90  Count00  CountDiff
10323      Michael      M    65275    32028     -33247
2         Brittany      F    36534     5183     -31351
0          Jessica      F    46470    15705     -30765
1           Ashley      F    45553    17997     -27556
10324  Christopher      M    52331    24928     -27403
3           Amanda      F    34405     8550     -25855
6        Stephanie      F    24859     7029     -17830
...            ...    ...      ...      ...        ...
10405        Dylan      M     4414    15398      10984
10541       Hunter      M     1388    12535      11147
65          Alexis      F     5256    17627      12371
10342        Jacob      M    22005    34467      12462
29          Hannah      F    10274    23075      12801
10550         Noah      M     1305    14265      12960
202        Madison      F     1407    19967      18560

[17544 rows x 5 columns]

## Exercises

**Question 1.** Merge the 1990 data with the 2000 data, but do a left join instead of an inner join.

Are there any missing values in the 1990 column? What about the 2000 column? Can you interpret what these missing values mean?

In [40]:
data_leftMerge = data90.merge(data00, how='left', on=["Name", "Gender"], suffixes=("90","00"))
data_leftMerge.fillna(0)
data_leftMerge["Count90"].isnull().sum(), data_leftMerge["Count00"].isnull().sum()

(0, 7171)

**Question 2.** Merge the 1990 data with the 2000 data, but do a right join instead of an inner join.

Are there any missing values in the 1990 column? What about the 2000 column? Can you interpret what these missing values mean?

In [41]:
data_rightMerge = data90.merge(data00, how='right', on=["Name", "Gender"], suffixes=("90","00"))
data_rightMerge.fillna(0)
data_rightMerge["Count90"].isnull().sum(), data_rightMerge["Count00"].isnull().sum()

(12220, 0)

**Question 3.** Merge the 1990 data with the 2000 data, but do an outer join instead of an inner join.

Are there any rows with missing values in _both_ the 1990 and 2000 columns? Why or why not?

In [42]:
data_outMerge = data90.merge(data00, how='outer', on=["Name", "Gender"], suffixes=("90","00"))
data_outMerge.fillna(0)
data_outMerge["Count90"].isnull().sum(), data_outMerge["Count00"].isnull().sum()

(12220, 7171)

**Question 4.** The code below produces a version of the 1990 data frame where `Name` and `Gender` are indices (instead of columns). How would you merge this data frame to the 2000 data frame now? 

_Hint:_ Take a look at the documentation for `.merge()`.

In [47]:
data90_reindex = data90.set_index(["Name", "Gender"])
data90_reindex

data90_reindex.merge(data00,left_index=True, right_on=["Name", "Gender"], suffixes=["1990", "2000"])

       Count1990       Name Gender  Count2000
7          46470    Jessica      F      15705
3          45553     Ashley      F      17997
59         36534   Brittany      F       5183
31         34405     Amanda      F       8550
6          25865   Samantha      F      17264
4          25810      Sarah      F      17689
39         24859  Stephanie      F       7029
...          ...        ...    ...        ...
18644          5     Zander      M        150
24477          5   Zedekiah      M         10
25852          5     Zephan      M          8
20572          5       Zeus      M         31
22218          5      Ziyad      M         17
25062          5      Zoran      M          9
24480          5        Zvi      M         10

[17544 rows x 4 columns]

**Question 5.** What happens if you only join on `Name` (not on `Gender`)?

_Hint:_ Look for the name "Jessica" in the merged data frame. How many times does it appear? What do you notice?

In [ ]:
# ENTER CODE HERE

## A Word on `.join()`

When the variables you want to join on are the indices of _both_ data frames, you can use the `.join()` method instead of `.merge()`. However, as you saw above, you can do the same thing with `.merge()` using `left_index=True` and `right_index=True`. Using `.join()` just saves you some typing if you really want to join on the indices.

In [ ]:
data90_reindex = data90.set_index(["Name", "Gender"])
data00_reindex = data00.set_index(["Name", "Gender"])

In [ ]:
data90_reindex.join(data00_reindex, lsuffix="1990", rsuffix="2000")